CSI API ETABS v1

# cLineElm Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cLineElm

    Public Interface cLineElm

    Dim instance As cLineElm

    public interface class cLineElm

    type cLineElm =  interface end

The cLineElm type exposes the following members.

Methods

| Name| Description
---|---|---
|
Count|
|
GetEndLengthOffset|
|
GetInsertionPoint|
|
GetLoadDistributed|
|
GetLoadPoint|
|
GetLoadTemperature|
|
GetLocalAxes|
|
GetMaterialOverwrite|
|
GetModifiers|
|
GetNameList|
|
GetObj|
|
GetPoints|
|
GetProperty|
|
GetReleases|
|
GetTCLimits|
|
GetTransformationMatrix|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com